# SmallBendRadius Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..SmallBendRadius Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
The value you entered for the bend radius for conduit is too small. Enter a larger value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SmallBendRadius { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SmallBendRadius As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SmallBendRadius {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace